<!DOCTYPE html>
<html>
<head>
	<title>导论课感想</title>
	<meta charset="utf-8">
	<meta name="author" content="帅帅的小泽儿">

</head>
<style>
	.column {
	  float: left;
	  padding: 10px;
	}

	/* 左右两侧宽度 */
	.column.side {
	  width: 25%;
	}

	/* 中间区域宽度 */
	.column.middle {
	  width: 50%;
    }

    h4 {
		color: grey;
		font-weight: 500;
	}

	.suojin {
		text-indent: 2em;
	}
	.xinzhi {
        background: top;
        background-image: url(<?php bloginfo("template_url") ?>/img/grow/stories/xinzhi/信纸3.jpg);
        padding: 10px;
		background-attachment: fixed;
	}
	.xinzhi p {
		color: #293047;
		font-weight: 600;
		font-family: 	\5FAE\8F6F\96C5\9ED1;
		font-size: 14px;
		line-height: 1.75em;
		letter-spacing: 1px;
	}
</style>
<body>
	<div class="column side">
	</div>
	<div class="column middle">   <!-- 网页主区域 -->

	<h2>刘辰尧的精彩发言</h2>
	<h4>原创： 刘辰尧  2018-06-11</h4>
	<p><br/></p>
		<div class="xinzhi"> <!-- 文章主内容区域 -->
			<p class="suojin">转眼间大一上学期的学习生活已经接近尾声。回想半年之前，来到北邮，真的是阴差阳错而又命中注定，刚刚开学时，每一节课我都是忐忑度过的，在这样一个信息黄埔中，在这样一个肩负传邮万里使命的学院中，一个从未了解过编程，从未学习过软硬件相关知识的小白，一个对自己所学专业充满迷茫和不解的新生，要如何在这里描绘出自己难忘的大学四年？</p>
			<p class="suojin">大半个学期之后，未来依然是未知的，是多变的，但是我已经知道，在这看似短暂的时间内，我已经实现了零的突破，实现了从无到有的蜕变，在这半年的学习生活中，给我带来的改变最大的课程非导论课莫属。</p>
			<p class="suojin">第一节导论课的场景仍然历历在目。十一放假之前的最后一节课，老师高强度大密度的授课让我们目瞪口呆，一节课之后，我们甚至连老师所留的作业是什么都没有听懂，更不必说明白神秘而又晦涩难懂的微信小程序究竟是何方神圣……因此，我们只能将十一长假献给导论课作业，整日与火花空间的教程相依为命，还“好事多磨”般地遇到了让四只小白濒临崩溃的硬件BUG。那个十一假期，我们懂得了自学，学会了自我探索，在呼吸灯亮起的那一刻，激动之情难以言表。</p>
			<p class="suojin">之后的每一堂课，我们都以一种飞快的速度接受着许多新的名词与技术，课堂时间有限，老师上课不可能面面俱到。课上提出一个点，为了完成作业，理解所涉及的内容，我们必须在课下将点自学扩展成面，并在各种各样神奇的报错中学习各种解决办法，“丰富阅历”。</p>
			<p class="suojin">在做导论课作业的过程中，我们也出现了各种各样的调侃语句：“导论课作业的一大功能：摧残身心，磨练意志”“听说数分很难？来点导论课作业试试“”上了导论课才明白，写数学作业是一件多么幸福和高效率的事情“……</p>
			<p class="suojin">可是然后呢？再难再苦再累，我们不都是坚持下来了吗？从一个小小的LED灯，到饶有趣味的指尖电子琴，到体验了各种报错才实现的气象站小程序，再到最后的期末创新大作业，得心应手地收发数据，根据意愿在微信小程序中添加各种功能，看到十余个电机错落有致、严密受控的转动，说不激动、不自豪是不可能的，从第一节导论课开始，仅仅两个月的时间，从茫然无知的门外汉到徜徉学海、小有进展的创新者，虽然知道自己要走的路还有很长，但是不得不对这两个月的进步感到赞叹。</p>
			<p class="suojin">回想导论展前的两周，真的是感慨万千。硬件部分纯手工拼接，各种元件的挑选和试验，初具雏形后，转换器出现的各种谜之BUG困扰了我整整半个星期，导论课教会了我们坚持；作品接近尾声时，焊接经验几乎为零的我们拿起电烙铁，用整整一天一夜的时间，带着防霾口罩焊出了最终的成品，导论课教会了我们耐心细致；由于误操作，导论展前一小时服务器崩溃，争分夺秒及时修正，导论课教会了我们冷静。</p>
			<p class="suojin">有人说，导论课是对自己所学专业的引导和介绍，但我认为，导论课让我学到的，不仅仅是专业的知识和技能，更是以后完成学习工作，甚至完成任何一项任务都必不可少的坚持探索的精神，让我们无论面对怎样的挑战，都勇于去尝试，去探索，去靠自己迈出第一步。</p>
			<p class="suojin">最后我想说，没有想到自己将一个严肃的导论课感想写成了心灵鸡汤，一路走来，我们的确体验了很多，也收获了很多，“天将降大任于斯人也，必先苦其心志，劳其筋骨，空乏其身，行弗乱其所为，所以动心忍性，曾益其所不能”，导论课的学习模式，就是一个激发我们的潜能，让我们绝地逢生的过程。暗透了，然后，星光灿烂。</p>
			<p class="suojin">我们的“盲点”项目链接<a href="https://www.oursparkspace.cn/?p=60949">>>>>戳<<<<</a> </p>
			<p><br/></p>
		</div>







	</div>
	<div class="column side">  <!-- 网页右侧空白区域 -->
	</div>
</body>