<!DOCTYPE html>
<html lang="en">
<head>
	<meta charset="UTF-8">
	<title>整蛊狗团队的故事</title>
	<style>
		* {
			margin: 0;
			padding: 0;
		}
		.colume {
			float: left;
			padding: 10px;
		}
		.side {
			width: 25%;
		}
		.middle {
			width: 50%;   /* 三栏布局 */
		}
		
		div h4 {
			color: grey;
			font-weight: 500;

		}
		.article {
            background: top;
			background-image: url(<?php bloginfo("template_url") ?>/img/grow/stories/xinzhi/信纸3.jpg);
            padding: 5px 10px;
			margin-bottom: 8px;
			border-radius: 15px;
			background-attachment: fixed;
		}
		.article h3, .article h4,.article p {
			font-family: 	\5FAE\8F6F\96C5\9ED1;
			line-height: 1.75em;
			letter-spacing: 1px;
		}
		.article h4 {
			color: grey;
			font-weight: 500;
			font-size: 15px;
		}
		.article p {
			color: #293047;
			font-size: 14px;
			text-indent: 2em;
			font-weight: 300;
		}

	</style>
</head>
<body>
	<div class="colume side"></div> 
	<div class="colume middle">
		<h2>超可爱的整蛊狗——团队故事</h2>
		<h4>原创： 整蛊狗团队  2017-12-25</h4>
		<p><br/></p>
		<div class="article">
			<h3>胡彤的感悟(一)<h3>
			<h4>关键词：创展第一天</h4>

     			<p>在经历了人生第一次通宵后，早晨身体全面崩盘，各种难受。然而支撑着用一早晨时间找到了昨晚一直做不好的部分的弥补方案、昨晚平均只睡了两个小时的宿舍四人下午强打起精神去参加创展时，还是深深地觉得人的潜力是无穷的。</p>
    			<p>早晨难受到根本站不起来，四个几乎没睡觉的人几乎都在崩溃边缘，然而在开始时间快到的时候却能给自己加油打气然后跑过去，一下午的时间站着精神抖擞地给来到展台前的专家、老师和同学讲解；原本觉得和许多大神相比起来很普通的作品，竟然被很多专家说做的非常棒非常有创意，还从他们的理解的角度给我们提了很多后续强化的建议，真的是受宠若惊。</p>
    			<p>感觉收获非常大。</p>
    			<p>用室友的话说，熬过了灾难般的昨晚后，今天终于在创展结束后松了一口气，感觉精疲力尽的同时，却又觉得特别开心，觉得世界特别美好。真的是这样。这是一次不一样的体验。</p>
    			<p>最后还有一些思考：</p>
    			<p>1.如果认真去看了看友情参展的大三学长学姐们的作品，就会发现大一和大三之间的区别还是很大的。不仅仅是代码写的比我们强很多、做出来的产品功能比我们强大许多，他们更注重产品的实际意义，更注重用户体验，看他们的作品时你会有一种诸如“如果这个东西未来能够推广并做到量产，一定会大大提高我们的生活质量／办事效率”的感受。不同于我们自己的作品娱乐价值高于实际应用价值，他们在创作时的思维和我们不同，这种思维的差异同时也反映出了一个人是重视眼前的娱乐还是有长远的思考规划，反映出了一个人创造社会价值的能力。我想这也是我欠缺的并需要持续改进的。</p>
    			<p>2.官方推荐你用的东西不一定就是最好的。只有当你多学习、多探索、多请教之后，才能找到最好的一种；</p>
    			<p>3.和专家交流是种很棒的体验。绝大多数的专家反而不是自己想象的那样严肃刻板、对我们这种水平做出来的东西不屑一顾的。相反，他们很平易近人，他们没有架子、会认真的听你的讲解并和你讨论想法，他们会以一种截然不同的思路来给你一些很棒的提议，他们会结合形势给你分析如何使你的作品更贴近需求、更符合时代潮流或者走在前沿、受众面更广……和他们交流几分钟的收获远远大于自己埋头苦干很久的所得。克服自己心里对于专家身份的惧怕感去自然地和他们互动，必受益无穷。</p>
    			<p>4.身边有很多非常优秀的同龄人，要打开自己狭隘的思想多向他们学习；</p>
    			<p>5.人的潜力是无穷的。你可以在很短的时间里爆发很强的能量学习大量的知识并完成看似不可能的任务。只要从心底相信并勇敢去做。</p>
    			<p>6.这么多年来，已学的东西其实少之又少，还有很多或实用或有趣的未知等待着我们去探索。学无止境，行无止境。</p>
		</div>
		<div class="article">
			<h3>胡彤感悟（二）</h3>
			<h4>关键词：导论_最后的总结</h4>
			<p>从周三中午报名参加比赛，晚上一起写代码到一点多；周四被Wifi模块和没有接口的Onenet搞到崩溃的人生第一次通宵；周五第一波专家、博导参与评分的展览以及晚上熬夜重新制作新的模型；再到今天上午第二波信息通信训练营参观……</p>
			<p>到现在，终于都结束了。</p>
    		<p>虽然导论课正儿八经的期末验收还没有进行，不过据说是线上验收，我们完善好参加创展的作品的创意、介绍、代码之类的资料就可以啦。</p>
    		<p>一学期的导论课，理论上我们都只是浅浅地了解了一点未来专业课要学的东西，可在创展的这里，真的深深体会到了即便是“导论”，还是有很多人借助着这一点点的引导，已经学到了大多人都无法想象的东西。</p>
			<p>都是靠自学的。</p>
    		<p>也让我明白了在自己为了一点小小的成就而满足时，还有很多很多人在以这点小成就为起点，开始真正深入探究更深更广的东西。知识永无止境。</p>
    		<p>传统的科目不会教给我这些。</p>
    		<p>只有当自己真正的在与前沿的知识与技术打交道时，才会明白到这种探索带来的价值。</p>
    		<p>也只有这样的接触，才会让自己时时刻刻体会到大学是不一样的。也许以前知道写代码是怎么回事，却也永远没有想过未来自己会用一行行敲出来的代码控制着硬件实现很多功能；没有想过自己会用电路实现很多很奇妙的事，没有想过自己会看到平日里使用的网站背后的复杂的世界；没有想过以前只是单纯用着一些软件，而现在自己也可以做出微信小程序、办一个公众号；没有想过自己亲手搭一个服务器，体会以前只有模糊概念的“云”……没有想到过的事很多很多。可如今它们真实的存在于自己的知识体系中，虽然很浅，但已经有了萌芽。</p>
    		<p>这个学习的过程，使我受益匪浅。</p>
    		<p>用开创了这门课的纪阳老师的话作为结尾：</p>
    		<p>“导论课与其他课不一样。它不是让大家一次学明白的，是让大家先有一次触摸，产生一个全局的概念，是为了让大家以后如果要做东西，可以慢慢跟着兴趣自学，也知道周边谁是大牛，应该怎么摸索的。其目的，不是成绩单，甚至也不是雏雁大创，是为了自己将来有时间感兴趣可以自己玩自己实验自己探索。</p>
			<p>导论课上一大堆实验提供了一个驱动自学的目标，你如果将来想作点东西做点事业，就得先把自学能力提升起来，才能在将来跟着自己的兴趣走。</p>
    		<p>昨天给其他学校分享我们大一新生这学期额目标是把小程序、智能硬件、网络、云等等全打通了，他们觉得难以想象。</p>
			<p>想到了，哪怕走几步，都是不一样的进步。爬过山之后，哪怕是坐缆车上去的，和始终在山下山外想象，肯定是不一样的。”</p>
		</div>
		<div class="article">
			<h3>程羽_20171223_感悟</h3>
			<h4>关键词：导论课创展</h4>
			<p>1）有的时候要学会逼自己，不逼迫自己无法激发自己的潜力。给自己设定一个很高的目标并为之努力，结果一定不会太差。如果你的目标是月亮，你至少也会身处群星。这次的导论课展很大程度上激发了我们的斗志、提高了自学的能力、学会了耐心解决各种难题，收获颇丰。</p>
			<p>2）深度学习。平时我对导论课的学习都是浅层次的，仅仅按照指导的步骤做出来最终结果并期盼着验收得A，但是重要的不是课程的结果而是我们学到的知识、被激发了兴趣之后的主动学习，我觉得这些我都没有达到，反而在昨晚独自探索微信小程序时感受到了快乐，开始了真正的深度学习，这才是导论课的最终目的吧（我要好好学习制作小程序了）。纪阳老师一直想让我们学得快乐、学得有趣，从而达到主动学习终身学习的目的，教育者用心良苦。</p>
			<p>3）珍惜自己的创意。今天和学长学姐们交流，他们做的都是实用性非常强的作品，比如防盗监测碰撞数据的智能快递盒、性价比高实用性强的积水测量仪、创新的无人机等等，相比之下我们更像是纯粹为了喜欢而做，有个学长说：“挺好的，等你们老了你们也会开始考虑实用性，现在好好畅想吧。”创意和实践改变世界，珍惜来之不易的创意。</p>
			<p>4）互相交流学习有助于进步。参展时我们混迹于各个小组的摊位，了解他们厉害的点子，全组克服的技术难关，知道了别人在学什么在做什么。我们小组也有个悬而未决的技术难题请教了很多同级的大佬和学长学姐们，纠结了一晚上的wifi模块是因为内存不够，硬件实在太坑了，好好学编程。交流中了解了很多比如灰度传感器、超声波测距、request命令、小程序应用等等知识，收获极大！！</p>
			<p>5）语言表达很重要，展现你们项目吸引人的部分才能留住参观者。</p>
			<p>6）学会赞扬别人并提出建议。每次看完一个展位我都会主动称赞有创意的点子或者技术的复杂性，根据我所能想到的信息结合其他小组的项目提出建议，然后设想产品的应用场景。</p>
			<p>7）团队合作很开心。211寝室公元一年共同度过的第一个大难关，通宵奋战到第二天下午没吃早午饭，但是大家的意志都在坚持着，合作很开心，我们是彼此的依靠。劫后余生被我列为人生一大乐事。</p>
            <p>我们的“整蛊狗”项目链接<a href="https://www.oursparkspace.cn/?p=14957">>>>>戳<<<<</a></p>
		</div>
		
		
	</div>
	<div class="colume side"></div>
	
</body>
</html>