<!DOCTYPE html>
<html>
<head>
	<title>大一宿舍中诞生的创客团队</title>
	<meta charset="utf-8">
	<meta name="author" content="帅帅的小泽儿">

</head>
<style type="text/css">

	.box1{
		width: auto;
		height: auto;
		background-color:rgb(239,239,239);
		font-size: 14px;
		line-height: 1.75em;
		letter-spacing:0.1px;
		padding: 10px;
	}

	.box2{
		width: auto;
		height: auto;
		border-top-width: 2px ;
		border-top-style: solid;
		border-bottom-width: 2px ;
		border-bottom-style: solid;
		border-image:linear-gradient(to right,purple,pink) 1 10;
		font-size: 14px;
		line-height: 1.75em;
		letter-spacing:0.1px;
	}

	.column {
	  float: left;
	  padding: 10px;
	}

	/* 左右两侧宽度 */
	.column.side {
	  width: 25%;
	}

	/* 中间区域宽度 */
	.column.middle {
	  width: 50%;
    }

	.hong{
		color: rgb(100, 150, 235);
		font-weight: 700;
		font-size: 14px;
		line-height: 1.75em;
		letter-spacing:0.1px;

	}

	.answer{
		font-size: 14px;
		line-height: 1.75em;
		letter-spacing:0.1px;
	}

	h3{
		text-align: center;


	}

	h4{
		color: grey;
		font-weight: 500;
	}
	
	.name{
		font-weight: 700;
		letter-spacing:0.1px;
	}
    .middle > img{
        width: 100%;
        height: auto;
    }
</style>
<body>
	


 <div class="column side"></div>  <!-- 网页左侧空白区域 -->


<div class="column middle"> <!-- 网页中间主区域 -->

	<h2>大一宿舍中诞生的创客团队</h2>
	<h4>原创： 红领巾  2018-05-14</h4>
	<p><br/></p>

	<img src="<?php bloginfo("template_url") ?>/img/grow/stories/car/多功能小车1.jpg">
	<div class="box2" >
		<p>
			这个看起来酷炫又略带萌感的作品，是一辆基于Arduino UNO单片机制作实现的<span class="hong">多功能环境监测车。</span>其功能主要包括火焰探测，灰度寻迹，温湿度检测，红外遥控，自动报警，自动巡航等。
		</p>
		<p>监测车基于物联网端到端技术，实现小车采集数据的实时反馈；创建数据库即时接收储存数据，并且设计相应网页易于用户查看数据（反应时间小于10秒），如果遇到特殊情况实现即时报警功能。</p>
	</div>
	<p><br/></p>

	<p style="text-align: right;"> <!-- 采访 -->
	<strong><span style="font-size: 14px;">采访 | </span></strong>
	<span style="font-size: 14px;">施畅</span></p><p style="text-align: right;"><br /></p>

	<p><br/></p>
	<img src="<?php bloginfo("template_url") ?>/img/grow/stories/car/多功能小车2.jpg">

	<p><br/></p>
	<p class="answer">这个涉及了云计算、移动互联网、物联网、人工智能，即所谓“云移物智”四大新型信息技术领域的作品，从设计到研发、从软件开发到硬件搭建，全部出自北邮的大一学生团队！是他们在大一第一学期的工程导论课上完成的创新项目。</p>
	<p class="answer">大一同学们常常自称“萌新”，略带懵懂又对万事万物充满新鲜感，一堆mCookie开源硬件模块便能开启他们无限的潜能和干劲。北邮校友红领巾团队小记者近日对多功能环境监测车团队进行了采访。</p>
	<p><br/></p>

<h3>团队成员</h3><br/>

<p class="answer"><span class="name">“我们是宿舍四人组！”</span></p>
<p><br/></p>
<p class="answer"><span class="name">庞旭：</span>负责硬件设计，代码编写，整体架构，自制电机，Wi-Fi模块，超声波测距，红外遥控，灰度寻迹，文档撰写</p>

<p class="answer"><span class="name">钱骁伟：</span>负责硬件设计，代码编写，整体架构，I2C通信，火焰传感器，温度传感器，红外遥控，展板设计</p>

<p class="answer"><span class="name">冉越升：</span>负责Wi-Fi模块，数据传输，本地服务器、数据库建立</p>
<p class="answer"><span class="name">单兴中：</span>负责配件采购，功能测试，视频拍摄</p>
<p><br/></p>

<img src="<?php bloginfo("template_url") ?>/img/grow/stories/car/多功能小车3.jpg">


<!-- 以下是问答环节 -->
<h3>Q&A</h3><br/>
<p class="hong">红领巾：宿舍组队或团队协作的感受是什么？</p>
<p class="answer">宿舍组队的话，我们会更方便地进行讨论。</p>


<p class="hong">红领巾：大家都会利用什么时间做这些东西，平时在寝室都会研究吗？</p>

<p class="answer">当然会做研究，主要是兴趣。</p>


<p class="hong">红领巾：当初怎样想到做多功能环境监测车的？</p>
<p class="answer">我们这边主要是大一上学期在通信导论课上学了Arduino，于是就想课下自己做些小创意。比如，我们宿舍没有温度计，我们就我们就自己上网买了个Arduino温度测试模块，自己写代码，做出个宿舍温度计来。像这个信通导论展的创意也是这样，任何人都不可能一下想到非常好的创意，但是呢，我看过以前TED上有一个乐队关于创意的演讲，他们说得就特别好，“<strong>我们有可能一下想不出特别独特的创意，我们一开始只能想到一些很普通很普通的东西，我们很有可能想到100个普通的东西，想到0个创意，但是，如果我们从这100个普通的东西中提取出一些东西，随意组合，那或许组合出来的就是一个不错的创意。”</strong></p>
	<p class="answer">我们一开始根本没想到环境监测车，就是想做个遥控车自己宿舍里玩，然后呢，我们又想到做宿舍的温湿度监测装置，于是就想到把环境监测的模块，比如火焰传感器，温度传感器加在小车上，然后为了小车不撞到墙，我们又加了超声波测距和红外遥控，这个时候我们的创意就快想到了，我们想，这个车能监测环境，那干嘛不把数据发到电脑上手机数据呢？于是开始收集数据。</p>
		<p class="answer">收集完数据，感觉又没什么用，然后我们突然想到可以让车持续监测一个范围内的环境数据。这能用在哪呢？可以用在需要长期监管的工厂。那怎么让车自行监测工厂的各个位置呢？于是我们又添加了灰度寻迹功能。</p>
			<p class="answer">最后，我们环境监测车的创意就这样完成了。</p>
<p class="hong">红领巾：过程中有发生什么你觉得好玩的事情吗？</p>

<p class="answer">有时候会遇到比较有意思的问题，比如超声波测距，会测出报表的距离，然后温湿度显示0，寻迹寻着寻着小车就出去了，反正遇到的问题都挺有意思的。不过，<strong>能解决问题才是真的爽。</strong></p>
<p class="hong">红领巾：遇到困难，都怎么解决的呢？</p>
<p class="answer">俗话说的好，知之为知之，不知百度知，出问题了，就百度，看百度上面人家遇到类似的问题怎么解决的，然后再自己想办法。</p>








<h3>关于设计</h3><br/>
<div class="box1">
	
	<p class="answer"><span class="name">庞旭：</span></p>
	<p class="answer">其实就是弄明白每一个部分的原理，自然就能想到。比如我们自制的电机模块和I2C通信，就是从最先在导论课上学的时候弄明白三极管的原理及其用法——即单管放大元件。实际上，在没有学过模电的前提下，我也是后来才知道三极管是单管放大元件的。一开始，通过看导论课的电路图时，发现三级管就像个开关，只不过是通过电流控制开关的，而不是人工。</p>
	<p class="answer">这就是最初我获得的信息，这也是一个智力正常的人能获得的简单信息。然后就是电机，向电机输入不同方向的电流，电机转的方向也不同，这也是大家都知道的。那么现在关键的地方来了，那就是如何把已知的信息整合起来，想到电机可以连接两条电流方向相反的电路，通过开关控制哪条电路接通，哪条中断。而开关呢，就用三极管来充当就行了。</p>
	<p class="answer">也许你会感觉我上面的想法很独特，但其实一点都不。只是，在这个思路中，如果任意一个原理没有弄懂，那就是想不出来。所以，<strong>研究要从原理入手。</strong></p>
	
	<p class="answer">当知道直流电机运作时，红外遥控接收会出问题，那就想到用已学的I2C通信解决问题。关键还是你得知道怎么实现I2C通信。</p>
	<p class="answer"><strong>与其说设计能力，不如说通过自学解决问题的能力，还有就是尽量自己尝试，尽量不走寻常的老路，</strong>当时onenet传输有网络延迟，那就用本地服务器……服务器接收不到数据？那就用wireshark抓包，检查是否成功进行了三次握手……</p>
	<p class="answer"><strong>把自己的作品的bug一点点修复，我们只是把许多个百分百能做出的功能拼凑在了一起，然后就做出来了。</strong></p>
	<p class="answer">而设计创意也就是这么弄出来的。</p>
	<p><br/></p>
</div>
<p><br/></p>

<div class="box1">
	
	<p class="answer"><span class="name">钱骁伟：</span></p>

	<p class="answer">一开始，我们想尽量综合导论课所学，做出一些好玩的东西，于是有了小车的雏形。后来，我们考虑到了它的实用性，于是我们又针对项目需求增设功能并且调整小车的框架模型。最后，我们考虑到自身能力和用户体验，自建了本地服务器并设计了相应网页，使项目真正具有一定的实用价值。</p>
	<p><br/></p>

</div>
<p><br/></p>
<div class="box1">
	
	<p class="answer"><span class="name">单兴中：</span></p>

	<p class="answer">我们组的展品小车的原型，其实是基于庞旭同学对三极管的兴趣和对电机驱动的好奇所设计的自制电机组装而成的一个简易的小车。</p>
		<p class="answer">但是当我们四人决定以这个为基础作为我们的导论课作业时，我们便开始思考，这个小车，连同我们在导论课上学到的诸如传感器、Wi-Fi通信、OLED屏幕、LED彩灯的各种部件，组合在一起，会产生怎样的产品？<strong>这是在选修课上养成的思考模式，即，将本次结课作业当作一个产品来做。</strong></p>
			<p class="answer"><strong>作为一个产品，必须要有目标客户，要有实际的应用场景。</strong>于是在我们内部讨论后，决定<strong>综合循迹避障、火焰探测、温湿度探测、数据实时传输、红外遥控等技术，为物流仓储场景提供一个可供警报、监测功能的多功能小车。</strong>其实最终的功能总和，也是在讨论中慢慢完善的。</p>
			<p><br/></p>

</div>


<h3>关于团队</h3><br/>
<div class="box1">
	
	<p class="answer"><span class="name">庞徐：</span></p>
	<p class="answer">合作嘛，就是一个人想玩，然后带动其他人一块玩。想带动大家的积极性，自己首先就要有很高的热情。然后在制作的时候，根据每个人的长处分配合适的任务，就这么简单。</p>
	<p><br/></p></div>
	<p><br/></p>
<div class="box1">
	
	<p class="answer"><span class="name">单兴中：</span></p>
	<p class="answer">我们组的展品小车的原型，其实是基于庞旭同学对三极管的兴趣和对电机驱动的好奇所设计的自制电机组装而成的一个简易的小车。</p>



<p class="answer">但是当我们四人决定以这个为基础作为我们的导论课作业时，我们便开始思考，这个小车，连同我们在导论课上学到的诸如传感器、Wi-Fi通信、OLED屏幕、LED彩灯的各种部件，组合在一起，会产生怎样的产品？<strong>这是在选修课上养成的思考模式，即，将本次结课作业当作一个产品来做。</strong></p>



<p class="answer"><strong>作为一个产品，必须要有目标客户，要有实际的应用场景。</strong>于是在我们内部讨论后，<strong>决定综合循迹避障、火焰探测、温湿度探测、数据实时传输、红外遥控等技术，为物流仓储场景提供一个可供警报、监测功能的多功能小车。</strong>其实最终的功能总和，也是在讨论中慢慢完善的。</p><p><br/></p></div><p><br/></p>



<div class="box1">
	

	<p class="answer"><span class="name">钱骁伟：</span></p>



<p class="answer">我们四个人来自同一个宿舍，合作基础非常好，无论是相互交流还是相互学习都非常方便。针对本次的项目，我们组分工明确。冉越升自学了网页设计，本地服务器搭建，数据库搭建，主要负责网络部分。庞旭对小车的制作和电路设计很感兴趣，主要负责硬件部分。单兴中选修了纪老师的“互联网产业与创业”选修课，对于创新项目的理念和展示有一些想法，主要负责文案和展示的改进。而我对导论课教授的各类工具和Arduino部分感兴趣，且有一定的解决各类疑难杂症的能力，主要负责总体设计和难点攻克。</p>



<p class="answer">这样的分工是自然而然形成的，而四人工作之间的耦合程度不是很高，所以协调起来较为轻松。</p>
	<p><br/></p>
</div>
	<p><br/></p>


<h3>关于火花空间</h3><br/>
<div class="box1">
	<p class="answer"><span class="name">庞旭：</span></p>



<p class="answer">火花空间上有很多资料，这些资料连代码、怎么装配都写得一清二楚。但是，如果是单纯的按照上面的步骤组装，而不去<strong>思考背后的原理</strong>（代码为什么这么写，这个原理是怎么工作的），那就是只停留于火花空间上已有的创意了，永远无法实现突破了。</p><p><br/></p>
</div>
<p><br/></p>

<h3>关于导论课&创新作品展</h3><br/>
	<div class="box1">
<p class="answer"><span class="name">庞旭：</span></p>


<p class="answer">有人总说导论课太水，实则不知道重点是要自学的。刚开始上导论课的时候，我也想着把代码复制粘贴后随意改个参数应付了事。但是我的一个室友当时跟我说——<strong>一块看代码。</strong>遇到代码看不懂，那就把看不懂的地方上百度查，查明白了继续看，当能把代码全看懂的时候，基本上就是真的学会了。</p>



<p class="answer"><strong>我还记得那天我室友带着我把mCookie直流电机的代码完完全全看懂了，全看懂了，整整花了两个小时。但后来我们就养成了自己学习看代码、看原理的习惯，</strong>这样才能真正学到知识，这也是创新的第一步——没人会带着你创新，只有你自己去探索，如果你懒得去探索，那就只有停在原地自动放弃这良好的实践机会然后说导论课水了。</p>



<p class="answer">导论课给我们提供了广阔的创新平台！</p>
<p><br/></p></div><p><br/></p>
	<div class="box1">
		
<p class="answer"><span class="name">冉越升：</span></p>



<p class="answer">作为一个大一新生，<strong>能在进入大学之后的寥寥几个月的时间内就参加这种展览实在是十分幸运。</strong>在这次展览中，我观看了许多其他人的作品，每一个的背后都少不了辛勤劳动的付出。对技术的执着，对创新独到的理解。</p>



<p class="answer">这次展览让我学到了很多。也知道了自己还有那些不足，对今后的道路如何前进，如何努力的认识由模糊转到清晰。作为团队网络技术员，我明白了学无止境的道理，虽然自己学会了一种方法，可是对于这种方法的效率，性能，可扩展性等问题我其实没有一个清晰地认识。另外是否自己去做一个功能，还是直接利用框架完成任务也是一个不容忽视的问题。我一定会好好学习新技术，追逐时代潮流。</p>
<p><br/></p></div><p><br/></p>
<div class="box1">
	
<p class="answer"><span class="name">单兴中：</span></p>



<p class="answer">这次导论课创新展是一个很好的机会，第一天观展的，有很多大牛。他们在听讲解过程中也会提出许多疑问。比如我们引以为傲的自制电机和所谓的“差异性”，其实只是相较于本次参展的其他同学而言，如果将范围放大，我们做的东西，其他任何人也能想到、也能做出来。这些都让我印象深刻，<strong>也会让我受益终身：以后做项目或者自行创业时，我不同于其他人的点在哪里？怎样才能做出特色？怎样才能吸引用户选择我的产品，而不是其他同行业竞争者？我的核心竞争力在哪里？这些都是参展前所不曾考虑的事情。</strong></p>



<p class="answer">其次，<strong>如何应对、处理意料之外的不可抗力因素。</strong>比如本次参展，我们的Wi-Fi模块因为线头的松动，导致一根杜邦线的线头断在了面包板里。而后在进行更换杜邦线时，处理的不够精细，以至于参展的第一天无法现场演示数据实时反馈。这也让我思考颇多，在立项时一定要准备好应对意外的方案，俗话说不怕一万就怕万一。但当你将这万一也考虑在计划之内后，你将无所畏惧。我们当晚回到寝室后做了两方面的努力，一方面继续调试，检查数据和接线端口，另一方面，在Wi-Fi模块能够正常运行时录制、剪辑了视频，以便于在展位上播放，而且也能给观展者更好的认知体验。</p>



<p class="answer">总之，这次展览是一个不断学习的机会。参展前的准备中学习到了各种关于开源硬件与代码；参展前夜的冲刺，学习到了以怎样的心态面对重大事件；参展中既从别的小组那里学习到了很多，许多观展者的建议与意见更使我们受益匪浅，补上了我们构思、规划中的欠缺。（大概是第一人称视角与第三人称视角看待问题的差异吧。）</p>



<p class="answer"><strong>这次导论课创新展已经过去，但是它所带给我的进步与知识，会逐渐沉淀，如陈年老酒一般，随光阴流逝而愈加香醇、浓厚。</strong></p>
<p><br/></p></div><p><br/></p>


 <div class="column side">  <!-- 网页右侧空白区域 -->
 </div>

<!-- 底部盒子效果 -->

</div>


</body>
</html>