<!DOCTYPE html>
<html>
<head>
	<title>大二的她：有上千号粉丝的布道师</title>
	<meta charset="utf-8">
	<meta name="author" content="帅帅的小泽儿">

</head>
<style type="text/css">
	.box1{
		width: auto;
		height: auto;
		background-color: rgb(239,239,239);
		font-size: 14px;
		line-height: 1.75em;
		letter-spacing:0.2em;
	}

	.column {
	  float: left;
	  padding: 10px;
	}

	/* 左右两侧宽度 */
	.column.side {
	  width: 25%;
	}

	/* 中间区域宽度 */
	.column.middle {
	  width: 50%;
    }

	.hong{
		color: rgb(100, 150, 235);
		font-weight: 700;
		font-size: 14px;
		line-height: 1.75em;
		letter-spacing:0.2em;

	}

	.answer{
		font-size: 14px;
		line-height: 1.75em;
		letter-spacing:0.2em;
	}

	h3{
		text-align: center;


	}

	h4{
		color: grey;
		font-weight: 500;
	}
	
	.name{
		font-weight: 700;
		letter-spacing:0.2em;
	}
    .middle > img{
        width: 100%;
        height: auto;
    }
</style>
<body style="font-family:	Microsoft YaHei ">
	


 <div class="column side"></div>  <!-- 网页左侧空白区域 -->


<div class="column middle"> <!-- 网页中间主区域 -->

	<h2>大二的她：有上千号粉丝的布道师</h2>
	<h4>原创： 红领巾  2018-05-15</h4>
	<p><br/></p>

	<img src="<?php bloginfo("template_url") ?>/img/grow/stories/zmj/朱梦婕1.jpg">

	<div class="box1" >
		<p><br/></p>
		<p>
			<span class="name">朱梦婕：</span>「老师曾提及布道师的职责所在：1、己之所欲，施之于人；2、以自己做的事为荣；3、还要乐在其中。我觉得作助教的感受正是如此，你学过做过，觉得这些知识技能很好很有用，就希望更多的人也能学会。
		</p>
		<p>知识的分享者、传播者、践行者本身就是让人值得荣耀的身份。</p>
		<p>而乐在其中更不用说了，每每看到群里有人分享自己实验成功的视频，我都开心地像是自己第一次做成了那个实验一样，尤其是共同一步步debug最终成功了的，更是与有荣焉。」</p>
		<p><br/></p>
	</div>
	<br/>

	<p style="text-align: right;"> <!-- 采访 -->
	<strong><span style="font-size: 14px;">采访 | </span></strong>
	<span style="font-size: 14px;">潘峰</span></p><p style="text-align: right;"><br /></p>


		
	<p><br/></p>
	<p class="answer">创新型工程导论课已经正式进入北邮信息与通信工程学院2017版培养方案，并成为大一必修环节，学分从1学分调整到3学分，至今已正式开授两届。多功能环境监测车就是《大一宿舍中诞生的创客团队》在导论课中完成的创新项目。</p>
	<p><br/></p>


	<p class="answer">而这样的创新项目从分析、设计到开发，从硬件搭建到软件研发，并测试迭代，仅仅用一个学期的导论课学习时间，还是对于工程专业知识零起点的大一同学。<strong>要完成如此“繁重”的学习任务，同学们不仅需要自主地探索、老师的引导和队友的支持，更需要榜样来陪伴他们战胜学习中的困难。</strong>
	而优秀的学长、学姐们就是这样的榜样，<strong>没有说教，只有在一年级学生学习与创新过程中的陪伴、鼓励和指导，“2017信通院导论课”QQ群中热烈的答疑与交流说明了一切，</strong>
	而在这满满的聊天记录中，有这样一个id在九百多人中脱颖而出：</p>
	<p><br/></p>

	<img src="<?php bloginfo("template_url") ?>/img/grow/stories/zmj/朱梦婕2.jpg">

	<p class="answer">这位“梦婕小姐姐”是何许人也？</p>
	<p><br/></p>

	<p class="answer">2016级北邮信息与通信工程学院学生，大一学年平均成绩加权前专业（565人）第一， 2016 - 2017 学年国家奖学金获得者。身为项目负责人带领团队获得北邮首届“雏雁计划”创意大赛一等奖及NB-IoT创客马拉松一等奖；2017“批改网杯”高校英语写作大赛全国总决赛二等奖。大一在其年级社团联合会评定部任职；于宏福校区校广播站播音、剪辑。大一于北七家镇老年服务中心进行长期志愿服务活动，2017年北京马拉松志愿者。</p>
	<p><br/></p>

	<p class="answer"><span class="name">她是朱梦婕。</span></p>

	<img src="<?php bloginfo("template_url") ?>/img/grow/stories/zmj/朱梦婕3.jpg">

	<p class="answer">但真正让她吸粉的是，她在QQ群中一个又一个及时有效的答疑、一段段对学弟学妹们鼓励引导的话语。她用文字“刷脸”，用行动在不知不觉中践行布道师的职责和理想。QQ群之外，作为一名导论课助教她还参与完成了mCookie复杂实验的验证及基于器材情况的改进，火花空间教程的维护及更新，电子信息类导论课中共计11个复杂实验的在线教程设计及录制，多校协作碎片化编程学习的初始题库的编写和审核......前不久，她还为首都师范大学的同学们进行了多校协作项目经验分享交流，用充满感染力的笑容、认真的态度和丰富的专业知识感染了更多的同学。</p>
	<p><br/></p>

	<img src="<?php bloginfo("template_url") ?>/img/grow/stories/zmj/朱梦婕4.jpg">

	<p class="answer">本期我们来听听“梦婕小姐姐”的声音。</p><p><br/></p>
	


	<!-- --------------下面是问答环节---------------- -->
	<p class="hong">红领巾：刚上大一时，是否有对未来四年的规划和目标？</p>
	<p class="answer"><span class="name">朱梦婕：</span>其实还没有很清晰的认知和规划。当时报考北邮是因为北邮的信息与通信工程是教育部学科评估的全国第一，又想学工科，所以大致了解了本专业将要学的内容和未来可能的就业方向就报了。当时只知道各门课都要努力好好学，不辜负冲着最好的专业来的目标，但学好之后未来做什么，并没有清晰的定位。</p><p><br/></p>

	<p class="hong">红领巾：经过一年的导论课学习和一学期的助教后，在专业未来发展方向上是否形成了清晰一些的认识？</p>
	<p class="answer"><span class="name">朱梦婕：</span>嗯！<strong>首先通过导论课的学习，就对未来专业将深入学习的内容，软件方面的和硬件方面的，都有了总体的认知和最初的实践。</strong>对以后会学什么怎么学，不再只是略知各个课程的名字，模电、信号、C++、程序设计，而是<strong>有了最初的感性的认识和体验。</strong>在导论课上，编程不再枯燥无味只能对着一块小黑屏看几句cout，模电也不再是公式套公式令人生畏的“四大名补”，而是能通过学习带来创新和喜悦的存在。</p>

	<p class="hong">而到了大二成为助教，一方面，当年导论课上积攒的软件和硬件经验已经使人获益；另一方面，新一届的课程体系和课程内容更加完善了，从arduino和mCookie的硬件模组，到OneNet云平台和微信小程序所形成的完整端到端系统，使我对本专业课程及未来的发展方向有了更加系统化和清晰深入的认知。</p>
	<p><br/></p>




	<p class="hong">红领巾：是否有老师做专业课程设置的介绍？当时听完有何感觉？</p>
	<p class="answer"><span class="name">朱梦婕：</span>记得大一开学典礼之后，紧接着就是一场大概两小时的全专业600人一起上的总体专业导论的讲座，PPT上列举出来了大学四年都什么时候学哪些课程，课程之间有什么相互承接和联系的关系，未来研究生如果打算偏理论要考什么偏实践要考什么......当时对其中很多几乎是第一次接触的名词，只能半蒙半猜，顺便对于每学期的挂科率和退学率有了深刻的印象，除此之外，还是不清楚到底学什么怎么学。</p>
	<p class="answer">而我们这届（2016级）每周开的通信工程导论课，由于是承上启下的一届，开设了四次火花空间的导论实验课的同时，仍保留了四次纯理论的专业导论课。<strong>当时就有很清晰的对比感，</strong>纯理论的课程抽象艰涩，除了“哇这个听上去很厉害”和信源信道啊信息论啊这些知其然不知其所以然的名词，也就不太知道什么了。</p>


	<p class="answer">而实验导论课与其形成了鲜明的对比，<strong>每一个小实验，每一个元件每一行代码，都是具体的、清晰的，点亮了小灯就是点亮了，代码实现了想要的功能就是实现了。不再是抽象的概念，而成了具体的体验和认知。</strong></p>
	
	<p><br/></p>


	<p class="hong">红领巾：第一次接触导论课是什么感觉？</p>
	<p class="answer"><span class="name">朱梦婕：</span>第一次接触非常开心而期待，<strong>觉得这就是自己想象中的大学生活要学的东西要做的事，</strong>而不是和高三一样只是上课刷题复习。学的过程还是会感到困难的，尤其是刚开始，因为高中时完全没接触过编程和这种模块化集成化的硬件，彼时火花空间也还没有现在这么完善，更是因为刚上大学不善交际而直到学期末才知道还有导论课的QQ群能来交流和答疑。便只能自己硬着头皮学，遇到bug想尽一切办法地解决，有时候三四个小实验就磨过去一整个下午，但每次最终成功的时候，都极有成就感。我想就是这些<strong>成就感，和对于动手实践学习的最初的热忱，</strong>让我一路坚持了下来。</p>
	<p><br/></p>

	<p class="hong">红领巾：有感受到导论课的学习带给你了什么不一样的成长和收获吗？</p>
	<p class="answer"><span class="name">朱梦婕：</span>
	和其他小伙伴的交流中会感受到一些吧。大一上学期结束后的寒假，高中同学聚会，和其他人聊天，才知道并不是每个理工科学校的大一都会有这样的实验课和动手实践的机会，有的上偏人文社科的同学更是学学英语数学其他时间就可以放开玩。当时把以及小组的导论课期末成果录的视频给同学看，小伙伴都觉得很厉害，自己我挺有成就感。</p>
	<p><br/></p>
	

	<p class="hong">红领巾：你觉得现在90年的大学生，与80/70年的大学生相比是否存在不同？你们的优点或优势是什么？又存在哪些方面的不足，比如有些学生打游戏，是缺乏自制力还是没有找到合适的兴趣点？</p>
	<p class="answer"><span class="name">朱梦婕：</span>其实没有很清晰的认知，因为并不太清楚普遍7080后的各大高校的毕业生是什么样的。个人感觉我们这一代其实相对面对着更大的压力，机遇和挑战并存吧，但其实哪一代也都是这样，真正能脱颖而出的就是那些最优秀的人。</p>
	<p class="answer">关于打游戏的问题，一个角度来说，每一代都有诱惑，7080不是王者荣耀，但他们的网游ktv的诱惑一样不少。当然另一方面手游的存在因为随时随地都能玩，或许更容易接触也更容易上瘾吧，个人感觉核心问题之一是压力和自控力，上大学后来自外界的压力确实看似比高三骤然轻了许多，如何自处，能否耐得住寂寞、挑战、难题甚至折磨继续努力，每个人的状态都不一样吧。</p><p><br/></p>
	
	

	<p class="hong">红领巾：最开始是什么原因触动你去给大一当助教？在繁忙的学业和其他各项工作压力下，如何兼顾助教和学习等其他活动的精力分配？</p>
	<p class="answer"><span class="name">朱梦婕：</span>最初的契机是因为有一些播音的底子、导论课又学的好而被吴老师叫来录导论课的教学视频，发现当时火花的教程还有许多不足的地方，和吴老师交流的时候，老师感觉我对这件事热情很足，便问要不要做长期的助教。</p>
	<p class="answer"><strong>现在想想，彼时看似是一时兴起而决定成为助教，实则大一自己学习时的无助感和由此而期望学弟学妹能得到些许助力的心情，早已在心底盘桓了许久。</strong>也正是这份始终不变的初心，支持着我一路走到今天。</p>


	


	<p class="answer">谈及学业和助教工作的兼顾，2017级的学弟学妹们刚开始上导论课、问题最集中的十一假期期间，因为是刚开学，学业尚不繁忙，和辜寂两个人守着群遇到问题秒回也乐此不疲。之后学业压力渐重，一方面是安排了助教的轮班机制，每个助教一周两天轮流答疑，大家的合作减轻了彼此的负担。另一方面，还是要尽可能地对时间的高效利用和提高自己学习的效率。<strong>记得有一周周末考信号与系统的期中，由于时间实在调不开而在那周的周三、周四两天到本部录制二、三单元十个实验的教学视频，那阵儿往返本部的车上都在看信号的ppt、把往年卷子拍在手机上做题。</strong>就这样尽己所能地努力，幸而一学期后最终排名专业第三，学业没有因此退步。</p>
	<p><br/></p>
	



	<p class="hong">红领巾：大一时的导论课学习和现在做助教感觉有什么不同，感觉个人能力上是否有提升？</p>
	<p class="answer"><span class="name">朱梦婕：</span>首先，自己会做某个实验，和能带着学弟学妹把一个实验做通、能解决各种问题，本身就是不同的。后者要求对整个实验的原理和流程、容易出错的细节都一清二楚，毕竟每个人可能出bug的地方都不同。另外，新一届导论课添加了微信小程序和ONEnet云平台的相关实验，也对助教提出了更高的要求。总之对学习能力、学习经验和与人交流沟通的能力都有很大促进。</p><p><br/></p>


	<p class="hong">红领巾：看到你们有时过了凌晨，甚至假期都还活跃在QQ群中答疑，感觉挺辛苦的。</p>
	<p class="answer"><span class="name">朱梦婕：</span>
	说实话也有苦的时候，比如我十一假期在高铁站候车的时候还用移动键盘整理出了第一版的FAQ；比如在上海陆家嘴那块儿逛的时候，惦记着有一个问题一直有人反复反复问，想把它加在wiki里强调一下，字体加粗加红，结果边下楼梯边在手机上修改的时候，一脚踩空扭到了脚。</p>

	<p class="answer">但怎么说呢，<strong>因为热爱，所以值得。</strong>苦是值得的，耗的时间也是值得的，虽然以后可能没有几个人会记得当年助教的名字，当初实验的知识也早已太过浅显而不实用。<strong>然而，在最初的路上，我们曾陪着他们走过，在最初的名为创新的门扉之前，我们曾为他们推开门出过一份或大或小的力量，虽然未来那个璀璨光辉的世界终而要他们自己去探索去感受去闪耀，但我们曾在一切的起点参与过，努力过，也见证过，便足以令人欢喜了。</strong></p>
	<p><br/></p>
	



	
 <div class="column side">  <!-- 网页右侧空白区域 -->
 </div>

<!-- 底部盒子效果 -->
<section style="display: inline-block;border-width: 1px;border-style: solid;border-color: rgb(192, 200, 209);padding: 10px;background-color: rgb(239, 239, 239);width: 50%;box-sizing: border-box;">
	<section style="box-sizing: border-box;" powered-by="xiumi.us">
		<section style="box-sizing: border-box;">
			<section style="box-sizing: border-box;">
				<p style="box-sizing: border-box; text-align: center;">
					<span style="font-size: 14px">这是关于朱梦婕小姐姐的故事。</span>	
				</p>
				<p style="box-sizing: border-box;text-align: center;">
					<span style="font-size: 14px">你，</span>	
				</p>
				<p style="box-sizing: border-box;text-align: center;">
					<span style="font-size: 14px">pick哪一面的她？</span>	
				</p>
			</section>
		</section>
	</section>
	
</section>
</div>


</body>
</html>