<!DOCTYPE html>
<html>
<head>
	<title>导论课感想</title>
	<meta charset="utf-8">
	<meta name="author" content="帅帅的小泽儿">

</head>
<style>
	.column {
	  float: left;
	  padding: 10px;
	}

	/* 左右两侧宽度 */
	.column.side {
	  width: 25%;
	}

	/* 中间区域宽度 */
	.column.middle {
	  width: 50%;
    }

    h4 {
		color: grey;
		font-weight: 500;
	}
	.suojin {
		text-indent: 2em;
	}

	.xinzhi {
        background: top;
        background-image: url(<?php bloginfo("template_url") ?>/img/grow/stories/xinzhi/信纸3.jpg);
        padding: 10px;
		background-attachment: fixed;
	}
	.xinzhi p {
		color: #293047;
		font-weight: 600;
		font-family: 	\5FAE\8F6F\96C5\9ED1;
		font-size: 14px;
		line-height: 1.75em;
		letter-spacing: 1px;
	}


</style>
<body>
	<div class="column side">
	</div>
	<div class="column middle">   <!-- 网页主区域 -->
	<h2>冯昕澳的精彩发言</h2>
	<h4>原创： 冯昕澳  2018-06-07</h4>
	<p><br/></p>
		
		<div class="xinzhi"> <!-- 文章主内容区域 -->
		<p>尊敬的校领导，老师，亲爱的同学们：</p>
		<p>大家上午好！</p>
		<p class="suojin">我是信通18级14班的冯昕澳，很荣幸代表大一新生在这里讲话，今天我主要想分享一下有关导论课学习的收获与感受。
		先来说一下为期十周左右的课程学习。</p>
		<p class="suojin">还记得同学们第一次上导论课的场景，上课前满怀好奇与期待，然而从课上到一半开始同学们就开始偷偷交流起来：“老师在说啥？你们听懂了么？”“完了完了，感觉要被退学了……。回到宿舍，面对一堆完全看不懂的代码，我们只能默默地开始漫长的复制粘贴之旅，对于导论课验收也只能在心里默默祈祷，希望抽到一个简单的题目。</p>
		<p class="suojin">可正如古诗“随风潜入夜，润物细无声”描述的一样，这看似无用的复制粘贴却在不知不觉间，提升着我们的能力，让我们对于陌生知识的恐惧也在逐渐减少。</p>
		<p class="suojin">慢慢的，可能你会突然觉得“哎，这个电路还挺有意思，竟然能自制一个简单的电子琴。”于是便开始仔细阅读代码，遇到不会的了和舍友，同学讨论讨论，甚至会拿着电脑在不同宿舍间来回穿梭，突然感觉，和同学交流解决问题充满了乐趣，那些代码没有以前那么晦涩难懂了，上课也能稍微听懂一些了，不经意间，心里便对每周一次的导论课开始有了稍许的小期待。</p>
            <p class="suojin">渐渐的，我们已经习惯了这样的学习模式，对于实验验收也变得得心应手，每次都能看到有同学拿着自己改的代码或者自己做的小东西向老师，助教展示，虽然背后付出了许多时间和精力，但是当得到老师的认同时，那种油然而生的自豪感与成就感却能将心中的疲惫一扫而空。导论课在我们心中已然从抗拒变成了期待。</p>
		<p class="suojin">但十周时间转眼即逝，创新展悄然来临。这下连教程都不能完全看懂的我们连教程都没了。从做什么，怎么做，到做成什么样，都需要一个团队自己讨论自己构思，更重要的是时间只有四周！在如此紧迫的时间下，同学们都开始紧锣密鼓的筹备起来。</p>
 		<p class="suojin">一有空闲，就能看到同学们三三两两的聚在一起讨论自己的项目，在整体构思基本完成之后，便开始分工，有的开始去购买项目所需要的器材，有的去思考项目功能实现的方法，有的则去学习代码的书写与逻辑。在项目的实施阶段，困难一定是无处不在的。就拿写代码举个例子，当我们想通过代码实现一些功能的时候，这时候，我们会先利用网络，在火花空间，百度，CSDN等网站找相关知识，选取其中可以利用的部分，然后几个负责写代码的同学聚在一起，一行一行的研究，讨论，在搞清楚代码的含义之后，选择其中的部分代码进行修改，但是在修改的时候往往会出现无穷多的bug。这时候每个人都会提出不同的思路，在讨论论证每一条方案的可行性之后，再一个个进行尝试，在失败后再进行反思，总结。因此，我们经常可以看到一个个团队挑灯夜战，解决问题直到直到深夜。</p>
		<p class="suojin">说到解决困难，不得不提的就是勤勤恳恳的助教以及传帮带，创客马拉松这两次活动。因为并非所有问题都是小组讨论过后就可以解决的，这时候我们就可以通过QQ群向助教，也是我们的学长学姐进行提问，他们的细心解释总能完美的解答我们心中的疑惑。在传帮带活动上，每个班的直系学长学姐都会就导论展的相关问题进行回答，也向我们介绍了他们参加导论展的相关经验，令我们受益匪浅。在创客马拉松上，更是有助教面地面亲自解答各组的问题，在他们的帮助下，一天的创马活动，更是成为了许多小组获得突破性进展的里程碑。学长学姐们在学习之余抽出时间为学弟学妹耐心解疑答惑，这无疑是北邮精神在一代代北邮人之间传递的最好证明。</p>
		<p class="suojin">就在昨天，有的同学给我说说：“我可能一辈子都不会忘了这门课”。站在当下，回忆这半学期以来导论课学习，她为何会有如此大的魅力让人终身难忘？我想，首先，这是因为导论课是我们由高中的填鸭式教育走向自我主动学习的第一课，在导论课上，怎么学，学多少，学什么，是不是好好学都由自己负责，这种如脱胎换骨般的自主性一定会令我们铭记。其次是因为导论课自身丰富的意义。它的意义不仅仅在于你记住了什么，明白了什么，而更是在于它带给我们的潜移默化的提高，和多种能力的培养。尤其是创新展，他就像是对一个产品的设计和研发，不但体现了导论课：“真刀真枪，做点东西”的主旨，更让我们的自学能力，动手能力，交流能力，以及团队协作能力都得到了极大提升。这段艰辛与收获并存的经历，注定是大学生活甚至是每个人人生中浓墨重彩的一笔。</p>
		<p class="suojin">虽然过去的四周对大家来说是繁重的，但是现在，当大家看着自己面前的产品的时候，相信大家都是自豪，骄傲的。希望大家带着这份快乐，在今天展现出属于自己的风采。</p>
		<p class="suojin">最后，我仅代表18级大一新生，对在导论课学习上给予我们帮助的老师，学长表示衷心的敬意与感谢，同时希望导论课越办越好，也预祝本次创新展圆满完成。</p>
		<p class="suojin">谢谢大家！</p>
		<p class="suojin">总的来说，我感觉导论课是一个从听老师讲课不知所云到若有所得，若有所获的过程。</p>
            <p class="suojin">我们的“鱼家”项目链接<a href="https://www.oursparkspace.cn/?p=60422">>>>>戳<<<<</a></p>



		<p><br/></p>
		</div>









	</div>
	<div class="column side">  <!-- 网页右侧空白区域 -->
	</div>
</body>