<!DOCTYPE html>
<html>
<head>
	<title>导论课感想</title>
	<meta charset="utf-8">
	<meta name="author" content="帅帅的小泽儿">

</head>
<style>
	.column {
	  float: left;
	  padding: 10px;
	}

	/* 左右两侧宽度 */
	.column.side {
	  width: 25%;
	}

	/* 中间区域宽度 */
	.column.middle {
	  width: 50%;
    }

    h4 {
		color: grey;
		font-weight: 500;
	}

	.suojin {
		text-indent: 2em;
	}
	.xinzhi {
        background: top;
        background-image: url(<?php bloginfo("template_url") ?>/img/grow/stories/xinzhi/信纸3.jpg);
        padding: 10px;
		background-attachment: fixed;
	}
	.xinzhi p {
		color: #293047;
		font-weight: 600;
		font-family: 	\5FAE\8F6F\96C5\9ED1;
		font-size: 14px;
		line-height: 1.75em;
		letter-spacing: 1px;
	}
</style>
<body>
	<div class="column side">
	</div>
	<div class="column middle">   <!-- 网页主区域 -->

	<h2>有一种奇迹叫导论课</h2>
	<h4>原创： 井一诺  2018-06-09</h4>
	<p><br/></p>

		<div class="xinzhi"> <!-- 文章主内容区域 -->
		
			<p class="suojin">在正式学习这门课之前，我以为导论课只是告诉我们以后要学什么，没什么实际用处，水一水就好，然而一轮又一轮的验收，让我知道了这门课全是干货。整理电脑时突然发现桌面上的文件多了许多，九月以前我的桌面上只有一排软件，如今，桌面几乎已经满了，而这些里面有一大半都和导论课有关，有数不清的arduino已经写好的程序，有数不清的微信小程序的代码段，有改好的服务器端js文件，还有许许多多我18岁以前根本没听说过的开发环境。这让我突然很有成就感，从开学听说每个组都要开发一个微信小程序都不敢相信，到如今前端组件，API调用信手拈来；从对服务器这种东西的无限想象到现在基本掌握后台命令，运行自己需要的文件；再从感叹arduino能让我的小彩灯亮起来，到现在驱动12个电机不在话下。。。这一切，只需要一门导论课的时间。</p>
			<p class="suojin">在一个个与导论课共舞的夜晚，我收获的不仅是知识和技术，更多的是精神的磨砺。到现在我还清楚的记得那天凌晨1：44，第一次接受数据成功的我努力克制住自己激动的情绪，把好消息尽可能平静地告诉室友们，那晚，我觉得所有填过的坑，都是为了让我走向最后的胜利。也许是从那时候开始，我觉得导论课已经成了我的动力源泉，或者说没有了bug的生活是乏味无趣的。之后也遇到过许多困难，我似乎已经把它当成是平常事。经过许多次打击，被打倒以后又重新站起来已经成为我的一种习惯。当然，让人印象深刻的还有老师和助教们，导论课是一种文化，传帮带让我们更快地入门，助教们的传承的精神我相信会深深烙印在每一个大一新生的心里。记得从前刚入门时，会和室友评论哪个助教在群里回复脾气比较好，哪个助教还是小心为妙，但现在通过和助教们的接触，我越发感觉他们不是隔着屏幕冷冰冰的回复框，而是实实在在踏踏实实想帮助我们的学长学姐。而我们总是无知的在每次得到答案后不懂得说谢谢，总是会忽视他们在背后默默的努力。是助教和老师们的努力才让我们的导论课变得不再生硬，变得有温度，变成一种文化。</p>
			<p class="suojin">封装好产品的那个凌晨，我们收拾好东西去布置展板，一夜未睡的我们，格外兴奋。那天学活很冷，展厅内人很多，我们并不觉得冷，也不觉得累。当一切暂时结束时，突然间我觉得生活慢了下来。不用看代码看到眼疼，也不用调电路调到崩溃，曾经想要的“幸福”生活现在都实现了，可是我却觉得没有动力，干什么事情都觉得很无趣。我才发现自己已经爱上了这门课，或者说，这门艺术，这种文化。对它的万般不舍，或许不只是因为它让我们拥有了第一个属于自己的项目，更多的是因为想念那一个个有它陪伴的令我无比懊恼，又无比快乐的夜晚；因为想念老师和助教们的帮助和指点；因为想念和室友们一起奋斗的时光。。。对我来说它的名字已经不叫导论课，它的名字叫奇迹，我们亲手创造的奇迹。。。</p>
            <p class="suojin">我们的“盲点”项目链接<a href="https://www.oursparkspace.cn/?p=60949">>>>>戳<<<<</a> </p>

            <p><br/></p>

		</div>









	</div>
	<div class="column side">  <!-- 网页右侧空白区域 -->
	</div>
</body>