<!DOCTYPE html>
<html>
<head>
	<title>助教采访_伊甸</title>
	<meta charset="utf-8">
	<meta name="author" content="帅帅的小泽儿">

</head>
<style type="text/css">
	
	.column {
	  float: left;
	  padding: 10px;
	}

	/* 左右两侧宽度 */
	.column.side {
	  width: 25%;
	}

	/* 中间区域宽度 */
	.column.middle {
	  width: 50%;
    }

	.hong{
		color: rgb(100, 150, 235);
		font-weight: 700;
		font-size: 14px;
		line-height: 1.75em;
		letter-spacing:0.1PX;

	}

	.answer{
		font-size: 14px;
		line-height: 1.75em;
		letter-spacing:0.1PX;
	}

	h3{
		text-align: center;


	}

	h4{
		color: grey;
		font-weight: 500;
	}
	
	.name{
		font-weight: 700;
		letter-spacing:0.1PX;
	}
    .middle > img{
        width: 100%;
        height: auto;
    }
</style>
<body style="font-family:	Microsoft YaHei ">
	


 <div class="column side"></div>  <!-- 网页左侧空白区域 -->


<div class="column middle"> 

	<h2>助教采访——伊甸</h2>
	<h4>原创： 红领巾  2018-06-07</h4>
	<p><br/></p>

	<p style="text-align: right;"> <!-- 采访 -->
	<strong><span style="font-size: 14px;">采访 | </span></strong>
	<span style="font-size: 14px;">张帆</span></p><p style="text-align: right;"><br /></p>


	<img src="<?php bloginfo("template_url") ?>/img/grow/stories/yd/yd1.jpg">

	<p class="hong">红领巾：当时是怎样的契机开始成为了第一批助教呢？</p>
	<p class="answer">
			<span class="name">伊甸:</span>这个说来话长了，我们2015级是第一届在沙河的学生，而且就只有我们一届在沙河一直呆了两年。大一的时候纪老师在一个大班大概一百多人的通信工程专业导论课上招募了很多布道师让他们利用大概十套左右的mcookie301套件做一些东西，布道人数最多的布道师可以得到套件作为奖励。这是我第一次接触mcookie也是第一次接触创新，当时很激动，立马就和小组开始玩套件，只是运行了一下例程成功了就很激动，大家同样都很开心，这种感觉很棒。后来这个活动结束了以后我们开始筹备成立社团，并给它起名为“火花空间”。这样我们和很多有意愿的小伙伴们就一起玩mcookie了。</p>
	<p class="answer">
			当时还没有像现在这么多的资源吧，比如界面这么精美的网站，当时还只是在一个论坛上的创客版面进行交流，但是没有任何可以参考的东西，没有wiki，也没有老师能够解答疑惑，更没有学长学姐的经验，很多概念什么“函数”、“变量”都不是很清楚（课改前我们是大一下才有c++接触到编程），给我们带来了很大的困难。后来大二参加朱老师的创新实验，也是用mcookie，我们用mcookie做了一个报警器，那个时候有美科的工程师给我们解决疑惑，情况远不是之前能比的了，那时候就想要是大一的时候能够也有这种帮助就好了。</p>
	<p class="answer">
			后来在小学期结束的时候，纪老师要开设下学期大一的新版导论课，问我们这些了解mcookie多一点的“技术同学”愿不愿意当志愿者去教一下学弟学妹，当时就同意了。想来大一大二完全没有学长学姐的经验指导，对很多问题都不知道，比如学习上的问题，学习方法，以后毕业的方向，等等，大多数人都没有一个很清楚的概念，而且当时老师来上完课就走了，平时根本见不到，更不要说什么去实验室实习了，大一大二被封闭在沙河，出行都很不方便，完全过着高四高五的生活。也是这种原因，我希望能够尽己所能帮助一下学弟学妹。</p>





		
	<p class="hong">红领巾：做助教的时候会不会有时候很累？有想过放弃吗？</p>
	<p class="answer">
			<span class="name">伊甸:</span>基本上每次答疑值班的时候都会很累，因为助教数量不是很多，刚开始的时候大家问的问题太多，完全回答不过来。一个助教时分复用给八百多人答疑，服务器要崩了。尤其在第二天要验收的时候。后来优化了答疑的模式，很多重复性问题总结归纳了起来，这样就比较好了。但是还有很多问题，包括发现很多火花上教程的瑕疵，以及很多学弟学妹在表述问题的时候很迷，完全不知道他们在问什么，然后就需要花很多时间去详细地问。还真没想过放弃，年轻人精力旺盛，没有什么是刷一夜不能解决的，如果有就刷两夜，哈哈</p>


	<p class="hong">红领巾：帮助学弟学妹们的过程中有没有什么有趣的事情或者让你印象深刻的事情？</p>
	<p class="answer">
			<span class="name">伊甸:</span>有趣的事情有很多，比如一言不合就开始斗图啊，让我收集了一大堆表情包。很多时候不得不佩服大一新生的脑洞，一股清流，印象最深的就是导论课成果展上看到了用舵机“强行”控制开关的。年轻就是好啊。</p>


	<p class="hong">红领巾：作为助教，有没有过学弟学妹们问你问题把你问住了问蒙了的情况？</p>
	<p class="answer">
			<span class="name">伊甸:</span>这个当然有啊，其实很多设备的操作都很迷，同样的设备不同的电脑就是不一样，即使概率很小的问题，人数多了，也总有那么几个人会遇到。更不必说本身就很迷，包括我自己用的时候以及上届学长用的时候都很迷的wifi模块。另外火花空间的指导教程上也总有一下让人难以理解的语句，或许是我的语文不怎么好吧，get不到点上，有时候需要反复研读几遍才能大概弄清楚，然后再给学弟学妹答疑。在加上很多学弟学妹因为第一次接触很多专业术语不是很了解，于是问问题表述不是很明确，解答完了他做了一下才发现和他想要的效果不一样，让人哭死啊。</p>
	
	<p class="hong">红领巾：这些年当助教有什么感想？</p>
	<p class="answer">
			<span class="name">伊甸:</span>感受嘛，其实挺多的。和大一新生在一起交流，感觉自己年轻了不少。学习了三年课程，做了三年实验，考了三年试，感觉让人很皮了，没有大一那样质朴，富有激情和创新的活力了。每学期都是一个节奏，高强度的课程实验压力，让人有一些心累的感觉，生活没有一点新鲜的色彩就变得庸庸碌碌。而这些大一的学弟学妹也确实给我带来了很多乐趣。看着他们一点一点学习知识，陪着他们一起解决问题，一起卡住，一起百度教程，一起自学，享受最后一起做出成果那一刻的激动和自豪。“等风起”的快乐恰恰如此吧。</p>

			<p class="answer">另外让我感受很深的就是纪老师的这种教育模式，之前大一的时候还没有觉得有什么不同，当这种模式变成一个完整的体系以后你就会发现大一才是创新训练的最好时间，正式因为技术知识不够丰富才能天马行空，当有让想法变成现实的渴望以后，学习即变得愈发有动力。最后一点就是让我认识到了助教的重要性，很多时候即使实验老师也不能够在实验的整个阶段都能够及时给予学生指导，学生很多老师也没有那么多精力。但是实验过程中经常会让人做崩心态，就是当你全力以赴每天都围着实验转，依然无法跨越困难的沟壑，而周围人进度快的已经快做完提高实验了。如果你没有在北邮信通院读过是可能完全无法理解这种感受。你拿着问题去问老师，和老师解释半天老师只会告诉你这种方法可以或者不可以，但是你实际去做的时候就会得不到预期的结果，确实是你的问题，但是你能力所限，是一个你确实没有想到的地方。</p>
			<p class="answer">每个人听老师讲一遍内容都有不一样的认知，你学完相关的知识以后潜意识就觉得这是对的，所以即使在检查的时候你也不会注意到这样的问题。而这种问题只能和别人完整地一字不漏地讲清楚整个实验的过程中才会发现你和别人的想法有一些出入，而大多数时候老师不会给你一个点一个点去测电压，然后分析哪里哪里是正常的，哪里哪里可能有问题然后再去具体地检查。这时就非常需要助教这样一个角色。事实上，在所有课程中助教基本都是理论课有，我见过最认真的助教是会批作业到每一行每一个数字的小数点后的，但大多数基本都是一页一个对勾最后写个日期，发下来的时候发现和舍友答案不一样都是对的让人面面相觑。但是我觉得实验课才是最需要最需要最需要助教的，而很遗憾的是基本没有实验课有助教。这也是我为什么坚持助教的一个原因吧。</p>
			<p class="answer">在做一名助教的过程中也确实让我学到了很多，有收获也有成长，不仅是从其他助教那里，也从学弟学妹身上学到很多。</p>





	<p class="hong">红领巾：最后给学弟学妹们一些寄语吧！</p>
	<p class="answer">
			<span class="name">伊甸:</span>寄语估计每个人从小到大都听了不少，应该都是绝对一流和符合标准的，那我就直接送上他们的合集吧。经过一学期的导论课相信大家都知道如何自学了，那么现在可以打开浏览器，输入关键字“寄语”，点击百度一下了。我相信每个人都很优秀，无关于成绩，只是优秀，绝对的优秀。</p>
			<p><br/></p>

	<hr/>
	<p><br/></p>
	<div class="column side">  <!-- 网页右侧空白区域 -->
 	</div>
</div>


</body>
</html>
	


	

	<!-- 1.当时是怎样的契机开始成为了第一批助教呢？
	
	
	
	
	2.做助教的时候会不会有时候很累？有想过放弃吗？
	
	
	
	
	3.帮助学弟学妹们的过程中有没有什么有趣的事情或者让你印象深刻的事情？
	
	
	
	
	4.作为助教，有没有过学弟学妹们问你问题把你问住了问蒙了的情况？
	
	这个当然有啊，其实很多设备的操作都很迷，同样的设备不同的电脑就是不一样，即使概率很小的问题，人数多了，也总有那么几个人会遇到。更不必说本身就很迷，包括我自己用的时候以及上届学长用的时候都很迷的wifi模块。另外火花空间的指导教程上也总有一下让人难以理解的语句，或许是我的语文不怎么好吧，get不到点上，有时候需要反复研读几遍才能大概弄清楚，然后再给学弟学妹答疑。在加上很多学弟学妹因为第一次接触很多专业术语不是很了解，于是问问题表述不是很明确，解答完了他做了一下才发现和他想要的效果不一样，让人哭死啊。
	
	
	
	5.这些年当助教有什么感想？
	
	另外让我感受很深的就是纪老师的这种教育模式，之前大一的时候还没有觉得有什么不同，当这种模式变成一个完整的体系以后你就会发现大一才是创新训练的最好时间，正式因为技术知识不够丰富才能天马行空，当有让想法变成现实的渴望以后，学习即变得愈发有动力。最后一点就是让我认识到了助教的重要性，很多时候即使实验老师也不能够在实验的整个阶段都能够及时给予学生指导，学生很多老师也没有那么多精力。但是实验过程中经常会让人做崩心态，就是当你全力以赴每天都围着实验转，依然无法跨越困难的沟壑，而周围人进度快的已经快做完提高实验了。如果你没有在北邮信通院读过是可能完全无法理解这种感受。你拿着问题去问老师，和老师解释半天老师只会告诉你这种方法可以或者不可以，但是你实际去做的时候就会得不到预期的结果，确实是你的问题，但是你能力所限，是一个你确实没有想到的地方。每个人听老师讲一遍内容都有不一样的认知，你学完相关的知识以后潜意识就觉得这是对的，所以即使在检查的时候你也不会注意到这样的问题。而这种问题只能和别人完整地一字不漏地讲清楚整个实验的过程中才会发现你和别人的想法有一些出入，而大多数时候老师不会给你一个点一个点去测电压，然后分析哪里哪里是正常的，哪里哪里可能有问题然后再去具体地检查。这时就非常需要助教这样一个角色。事实上，在所有课程中助教基本都是理论课有，我见过最认真的助教是会批作业到每一行每一个数字的小数点后的，但大多数基本都是一页一个对勾最后写个日期，发下来的时候发现和舍友答案不一样都是对的让人面面相觑。但是我觉得实验课才是最需要最需要最需要助教的，而很遗憾的是基本没有实验课有助教。这也是我为什么坚持助教的一个原因吧。在做一名助教的过程中也确实让我学到了很多，有收获也有成长，不仅是从其他助教那里，也从学弟学妹身上学到很多。
	
	
	6.最后给学弟学妹们一些寄语吧！
	
	 -->